/* Task 1 */
/* 
Реалізуйте клас, що описує геометричну фігуру з властивостями та методами:
■ get-властивість для отримання назви фігури;
■ метод для обчислення площі фігури;
■ метод для обчислення периметра фігури.
■ метод для виведення інформації про фігуру в console.log().
■ статичний метод для порівняння площ фігур.
■ статичний метод для порівняння периметрів фігур.
■ статичний параметр для збереження кількості створених об’єктів.
Реалізуйте класи-спадкоємці: квадрат, прямокутник, трикутник. Перевизначте методи виведення та обчислень у класах-спадкоємцях. Створіть масив з різними фігурами та виведіть інформацію про кожну з них, включаючи площу та периметр.
 */

class Figure {
  static #counter = 0;

  #name;
  constructor(name, color) {
    Figure.counter++;
    this.#name = name;
    this.color = color;
  }

  get figureName() {
    return this.#name;
  }

  static get counter() {
    return this.#counter;
  }
  static set counter(value) {
    this.#counter = value;
  }

  area() {}
  perimeter() {}
}

class Square extends Figure {
  constructor(name, color, side) {
    super(name, color);
    this.side = side;
  }
  area() {
    return this.side ** 2;
  }
  perimeter() {
    return this.side * 4;
  }
}

class Rectangle extends Figure {
  constructor(name, color, side) {
    super(name, color);
    this.side = side;
  }
  area() {
    return this.side ** 2;
  }
  perimeter() {
    return this.side * 4;
  }
}

const figures = [new Square("Square", "red", 10)];

/* Task 2 */
/*
Реалізуйте клас, що описує товар з властивостями та методами:
■ назва товару;
■ ціна товару;
■ кількість одиниць товару;
■ метод для виведення інформації про товар в console.log().
■ статичний метод для порівняння цін товарів.
■ статичний метод для порівняння кількостей товарів.
■ статичний параметр для збереження кількості створених об’єктів.
Реалізуйте класи-спадкоємці: книга, телефон, холодильник. Перевизначте методи виведення та обчислень у класах-спадкоємцях. Створіть масив з різними товарами та виведіть інформацію про кожен з них.
 */

/* Task 3 */
/*
Реалізуйте клас, що описує новину (заголовок, текст, масив
тегів, дата публікації). У класі необхідно реалізувати один метод
print.
Зверніть увагу, як виводиться дата:
■ якщо з дати публікації пройшло менше дня, то виводиться
«сьогодні»;
■ якщо з дати публікації пройшло менше тижня, то виводиться «N днів тому»
■ в інших випадках – повна дата у форматі «день.місяць.
■ статичний параметр для збереження кількості створених об’єктів.
рік». 
 */

/* Task 4 */
/*
Реалізуйте клас, що описує стрічку новин.
Клас має містити:
■ масив новин;
■ get-властивість, яка повертає кількість новин;
■ метод виведення на екран усіх новин;
■ метод додавання новини;
■ метод видалення новини;
■ метод сортування новин за датою (від останніх новин до
старих);
■ метод пошуку новин за тегом (повертає масив новин, в
яких вказано переданий тег у метод).
Продемонструйте роботу написаних методів.
 */
